# MechanicalEquipmentSetType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalEquipmentSetType Class
Members See Also
---
Represents a type for a set of interrelated mechanical equipment in a MEP system that works together.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class MechanicalEquipmentSetType : ElementType
```

Visual Basic
---
```text
Public Class MechanicalEquipmentSetType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class MechanicalEquipmentSetType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Mechanical..::..MechanicalEquipmentSetType
# See Also
MechanicalEquipmentSetType Members
Autodesk.Revit.DB.Mechanical Namespace